/*Задача 4.Напишете функцията int binarySearch(int a[], int n, int
x), която получава като първи аргумент началото на масив а,
втория аргумент е дължината на масива, а третия аргумент е
числото, което търсим. Знаем, че масива в който ще търсим
елемента е предварително подреден. Сравняваме тъсения
елемент с елемента в средата на масива. Ако той е по голям от
този в средата търсим елемента от средата до края, ако е помалък го търсим в частта от началото до средата. Това се
повтаря, докато елемента от масива не стане равен с търсения.
Тогава връщаме номера на който се намира елемента в масива
или -1 ако не се съдържа в масива.*/
#include <stdio.h>

int binarySearch(int a[], int n, int x);

int main(){
    int a[] = {1,2,5,6,9,12,14,18,100};
    int n = 4;
    int x = 5;
    if(binarySearch(a,n,x) != -1){
       printf("is in arr on position : %d\n",binarySearch(a,n,x));
    }else{
        printf("is not in the arr");
    }
    return 0;
}
int binarySearch(int a[],int n,int x){
    int m , l = 0;
    int h = n-1;
    while(l <= h){
        m = (l + h)/2;
        if(x < a[m]){
            l = m + 1;
        }
        else if(x > a[m]){
            l = m + 1;
        }
        else{
            return m;
        }
    }
    return -1;
}

