/*Задача 1. Напишете програма, която сумира всички елементи на масив
намиращи се на четна позиция:
int arr[10] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33};*/
#include <stdio.h>

int main(){
    int arr[11] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33};
    int *p = arr;
    int c = 10;
    int sum = 0;
    while(c!=0){
        sum  += *p;
        p +=2;
        c -= 2;
    }
    printf("Even sum = %d", sum);
    return 0;
}