/*Задача 4:
В какъв ред ще се изпълнят операциите?
true = x&&y&x<<1;
Какво ще се принтира на екрана?
В какъв ред ще се изпълнят операциите?
true = x&&y^x<<1;
Какво ще се принтира на екрана?*/
#include<stdio.h>

int main(){
    int x = 10;
    int y = 10;
    int true;
    true = x&&y&x<<1;
    printf("true = %d\n",true); /*1-во: х се шифтва с един бит наляво
                                 *2-ро: извършва побитовото И,
                                 *3-то: извършва логическо И , и резултатът е 0 */
    true = x&&y^x<<1;
    printf("true2 = %d\n",true);  /*1-во: х се шифтва с един бит наляво
                                   *2-ро: извършва побитовото изключващо ИЛИ
                                   *3-то: извършва логическо И , и резултатът е 1 */

    return 0;

}