/*Задача 9. Дефинирайте и инициализирайте променлива „а“.
Пойнтер към пойнтер към променлива.
Дефинирайте и инициализирайте пойнтер към нея.
Дефинирайте и инициализирайте пойнтер към първия пойнтер. Задайте
стойност на втория пойнтер 15.
Колко е стойността на променливата „а“?*/
#include <stdio.h>

int main(){
    int a = 4;
    int *p_a = &a;
    int **p_b = &p_a;
    **p_b = 15;
    printf("%d\n", a);//15
    return 0;
}