/*Задача 8.
Дефинирайте и инициализирайте променлива и пойнтер
към нея. Отпечатайте адреса на пойнтера с %p с printf.*/
#include <stdio.h>

int main(){
    int a = 20;
    int *p_a = &a;
    printf("%p\n",p_a); 
    return 0;
}